app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        # { user: { name: alksjdak email: ahsdkjalkjf}}
        if user.save!
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Darren"], ["email", "Darren@App"], ["created_at", "2023-03-09 00:37:14.632104"], ["updated_at", "2023-03-09 00:37:14.632104"]]