app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (2) LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (keys[0] LIKE values[0])
---
    def index
        # Lets assume query is key: :value combos
        # We want to know what the keys are

        # /users?name=Josh
        # /user?query='A generic string of stuff in here'
        # /user?query=Josh
        #

        if params.empty?
            input = User.all
        else
            # query_result = params[query]
            # User.where(name LIKE query_result)
            keys = params.keys
            values = params.values
            input = User.where("#{keys[0]} LIKE '#{values[0]}'")

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        input = User.find(params["id"])

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Aguilera"], ["email", "ryder@ryder.com"], ["created_at", "2023-03-09 17:36:19.613680"], ["updated_at", "2023-03-09 17:36:19.613680"]]
---
    def create
        user = User.new(user_params)
        # { user: { name: alksjdak email: ahsdkjalkjf}}
        if user.save!

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Aguilera"], ["email", "ryder@ryder.com"], ["updated_at", "2023-03-09 17:23:49.297573"], ["id", 1]]
---
    def update

        input = User.find_by(id: params[:id])
        if input && input.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]
---
    def destroy
        user = User.find_by(id: params[:id])
        user.destroy